Autodesk.DesignScript.Geometry.Properties.Resources.MeshPrecisionInfo
Looks up a localized string similar to The Mesh object supports coordinates and dimensions accurate to approximately 7 decimal places.  For very small or very large values, there may be minor inaccuracies due to rounding errors.  For tasks requiring extremely high precision, consider other Geometry objects that support higher precision..