Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
Creates a T-spline piped surface using a network of curves or lines.
A smooth joint is created at each curve intersection.
Some parameters take a single value or a list, two values per curve.
curves: A list of curves to create pipes from
defaultRadius: Default radius for created pipes
snappingTolerance: The tolerance used to detect curve intersections
segmentsCount: Numbers of segments in each pipe. Single value or list, two times longer than curves count, are allowed
endRotations: Values of end rotations for each pipe (in degrees). Single value or list, two times longer than curves count, are allowed
endRadii: Values of end radiuses for each pipe. Single value or list, two times longer than curves count, are allowed
endPercentage: Values (0 to 1) from the end of each input curve to start of the pipe mesh. Single value or list, two times longer than curves count, are allowed
inSmoothMode: Show T-Spline Surface in box or smooth visualization
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
Creates a match with a T-spline and a closed loop of curves
tsEdges: Closed T-Spline edge loop to create match with
curves: Closed curve loop to create match with
continuity: Geometry continuity to attempt to match: G0, G1, G2
useArclength: Wether to use arcLength alignment while building match
useRefinement: If true, extra control points will be added to the T-spline to match the surfaces within a given tole­rance.
numRefinementSteps: Max number of refinement steps. Ignored if useRefinement is set to false
refinementTolerance: Tolerance to hit. Ignored if useRefinement is set to false
usePropagation: Whether to use propagation while building match
widthOfPropagation: Determines how much of the surface is affected by the match. Ignored if usePropagation is set to false
tangentScale: Tangent scale. If continuity is not set to G1 is ignored
curvParamWeight: Carvature param weight. If continuity is not set to G2 is ignored
flipSourceTargetAlignment: Whether to reverse the alignment direction
Returns: T-Spline surface positioned between given T-Spline border edges and curve loop
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Edge},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
Creates a match with a T-spline and a closed loop of BRep edges. First,
the edge loop is converted to a curve loop and then the match is performed.
tsEdges: Closed T-Spline edge loop to create match with
brepEdges: Closed BRep edge loop to create match with
continuity: Geometry continuity to attempt to match: G0, G1, G2
useArclength: Wether to use arcLength alignment while building match
useRefinement: If true, extra control points will be added to the T-spline to match the surfaces within a given tole­rance.
numRefinementSteps: Max number of refinement steps. Ignored if useRefinement is set to false
refinementTolerance: Tolerance to hit. Ignored if useRefinement is set to false
usePropagation: Whether to use propagation while building match
widthOfPropagation: Determines how much of the surface is affected by the match. Ignored if usePropagation is set to false
tangentScale: Tangent scale. If continuity is not set to G1 is ignored
curvParamWeight: Carvature param weight. If continuity is not set to G2 is ignored
flipSourceTargetAlignment: Whether to reverse the alignment direction
Returns: T-Spline surface positioned between given T-Spline border edges and BRep edge loop
tspline,match,brep